In [2]:
import pandas as pd
import numpy as np

## 데이터프레임 생성

In [3]:
arr = (['A00301', 23, '남', '서울특별시'],
         ['D00809', 53, '여', '제주특별자치도'])
pdata = pd.DataFrame(arr, columns = ['환자코드', '연령', '성별', '거주지'])
pdata

     환자코드  연령 성별      거주지
0  A00301  23  남    서울특별시
1  D00809  53  여  제주특별자치도

In [4]:
data = pd.DataFrame([['환자코드', '연력', '성별', '거주지'],
         ['A00301', 23, '남', '서울특별시'],
         ['D00809', 53, '여', '제주특별자치도']])
data

        0   1   2        3
0    환자코드  연력  성별      거주지
1  A00301  23   남    서울특별시
2  D00809  53   여  제주특별자치도

In [5]:
arr = ([23, '남', '서울특별시'],
         [53, '여', '제주특별자치도'])
pdata = pd.DataFrame(arr, index =['A00301','D00809'], columns = ['연령', '성별', '거주지'])
pdata

        연령 성별      거주지
A00301  23  남    서울특별시
D00809  53  여  제주특별자치도

In [6]:
pdata.rename(index={'A00301':'환자1', 'D00809':'환자2'}, inplace=True)
pdata.rename(columns={'연령':'age', '성별':'gender', '거주지':'addr'}, inplace=True)

pdata

     age gender     addr
환자1   23      남    서울특별시
환자2   53      여  제주특별자치도

In [7]:
pdata.rename(index={'환자1':'가짜환자', '환자1':'진짜환자'}, inplace=True)

pdata

      age gender     addr
진짜환자   23      남    서울특별시
환자2    53      여  제주특별자치도

In [24]:
bio_data = {'나이':[25, 19], '성별':['남','여'],
           '키':[185, 163], '체중':[89, 53]}

df = pd.DataFrame(bio_data, index=['이겨레', '조약돌'])

df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [68]:
health = (['이겨레', 25, '남', 185, 89],
          ['조약돌', 19, '여', 163, 53])

df = pd.DataFrame(health, columns = ['성명', '나이', '성별', '키', '체중'])

df

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

## 열 데이터 선택

In [59]:
df.iloc[0]

성명     이겨레
나이      25
성별       남
키      185
체중      89
BMI      0
Name: 0, dtype: object

In [45]:
df.loc[0]

성명    이겨레
나이     25
성별      남
키     185
체중     89
Name: 0, dtype: object

In [46]:
df.iloc[[0, 1]]

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [47]:
df.loc[[0,1]]

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [48]:
df.iloc[0:2]

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

In [49]:
df.loc[0:1]

    성명  나이 성별    키  체중
0  이겨레  25  남  185  89
1  조약돌  19  여  163  53

## 행 데이터 선택

In [50]:
df[['성명']]

    성명
0  이겨레
1  조약돌

In [53]:
df.나이

0    25
1    19
Name: 나이, dtype: int64

In [55]:
df[['성명', '키', '체중']]

    성명    키  체중
0  이겨레  185  89
1  조약돌  163  53

In [56]:
df[['나이']]

   나이
0  25
1  19

## 열 추가하기

In [69]:
df['BMI'] = 0

In [66]:
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0

## 행 추가하기

In [70]:
df.loc[2] = 0

In [71]:
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0

In [72]:
df.loc[3] = ['김선호', 33, '남', 186, 73, 0]

In [73]:
df

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0
1  조약돌  19  여  163  53    0
2    0   0  0    0   0    0
3  김선호  33  남  186  73    0

## 단독 원소 선택하기

In [74]:
df.키[0]

185

In [77]:
df.loc[0, '키']

185

In [78]:
df.iloc[0][3]

185

In [83]:
df.iloc[[0]]

    성명  나이 성별    키  체중  BMI
0  이겨레  25  남  185  89    0

In [84]:
df.iloc[0, 3]

185

In [87]:
df.loc[0, ['키', '체중']]

키     185
체중     89
Name: 0, dtype: object

In [89]:
df.loc[0, '키':'체중']

키     185
체중     89
Name: 0, dtype: object

In [90]:
df.set_index('성명', inplace=True)

In [91]:
df

     나이 성별    키  체중  BMI
성명
이겨레  25  남  185  89    0
조약돌  19  여  163  53    0
0     0  0    0   0    0
김선호  33  남  186  73    0

In [92]:
df.loc['이겨레', ['키', '체중']]

키     185
체중     89
Name: 이겨레, dtype: object

In [93]:
df.loc['이겨레', '키':'체중']

키     185
체중     89
Name: 이겨레, dtype: object

## 여러 개의 원소 선택하기

In [95]:
df.loc[['이겨레', '조약돌'],['키','체중']]

       키  체중
성명
이겨레  185  89
조약돌  163  53

In [97]:
df.loc['이겨레':'조약돌', '키':'체중']

       키  체중
성명
이겨레  185  89
조약돌  163  53

## 열의 원소값 변경하기

In [98]:
df.loc['이겨레', 'BMI'] = 26.00
df.iloc[1, 4] = 19.95
df

     나이 성별    키  체중    BMI
성명
이겨레  25  남  185  89  26.00
조약돌  19  여  163  53  19.95
0     0  0    0   0   0.00
김선호  33  남  186  73   0.00

In [107]:
df.loc['0', '나이':'BMI'] = 27, '남', 177, 63, 15.55

In [108]:
df

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  53.0  19.95
0     0.0  0    0.0   0.0   0.00
김선호  33.0  남  186.0  73.0   0.00
0    27.0  남  177.0  63.0  15.55

In [109]:
df.loc[0, '나이':'BMI'] = 20, '여', 165, 43, 18

In [110]:
df

       나이 성별      키    체중    BMI
성명
이겨레  25.0  남  185.0  89.0  26.00
조약돌  19.0  여  163.0  53.0  19.95
0    20.0  여  165.0  43.0  18.00
김선호  33.0  남  186.0  73.0   0.00
0    27.0  남  177.0  63.0  15.55